Revit 2027 API
FabricSheet.FabricLocation Property
 The Fabric Sheet location in the host.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FabricLocation FabricLocation { get; set; }
Public Property FabricLocation As FabricLocation
	Get
	Set
public:
property FabricLocation FabricLocation {
	FabricLocation get ();
	void set (FabricLocation value);
}
member FabricLocation : FabricLocation with get, set
Property Value
FabricLocation
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  When setting this property:
See Also
Reference
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace